In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame([[1,1,3,54],[45,54,32,4],[4,3,2,2],[56,43,223,21],[34,55,4,2]],columns=['A','B','C','D'])

In [3]:
df1

    A   B    C   D
0   1   1    3  54
1  45  54   32   4
2   4   3    2   2
3  56  43  223  21
4  34  55    4   2

In [4]:
df2 = pd.DataFrame([[11,12,23,54],[425,514,312,4],[14,13,12,2],[56,433,2233,21],[355,24,2]],columns=['A','B','C','D1'])

In [5]:
df2

     A    B     C    D1
0   11   12    23  54.0
1  425  514   312   4.0
2   14   13    12   2.0
3   56  433  2233  21.0
4  355   24     2   NaN

In [6]:
df3 = pd.merge(df1, df2, right_on = 'D1', left_on = 'D')

In [7]:
df3

   A_x  B_x  C_x   D  A_y  B_y   C_y    D1
0    1    1    3  54   11   12    23  54.0
1   45   54   32   4  425  514   312   4.0
2    4    3    2   2   14   13    12   2.0
3   34   55    4   2   14   13    12   2.0
4   56   43  223  21   56  433  2233  21.0